import { BiSearchAlt2 } from "react-icons/bi";
import { BsQuestionLg } from "react-icons/bs";
import { IoDocumentOutline } from "react-icons/io5";
import { BsTranslate } from "react-icons/bs";
import { BsPeople } from "react-icons/bs";
import { AiFillThunderbolt } from "react-icons/ai";

const ar = {
  navbar: {
    home: "الرئيسية",
    services: "خدماتنا",
    about_us: "عنا",
    universities: "الجامعات",
    faqs: "أسئلة شائعة",
    contact: "تواصل",
  },
  hero: {
    header1: "مرحبا بكم في",
    header2: "سنساعدكم بكل ما تحتاجونه للدراسة في روسيا",
    button1: "الجامعات",
    button2: "خدماتنا",
  },
  services: {
    header: "خدماتنا",
    question: "ما هي الخدمات التي نقدمها",
    items: [
      {
        name: "بحث",
        description:
          "يمكنك من خلال الموقع البحث عن الجامعة المناسبة لك حيث يتيح لك البحث اعتمادا على : المستوى الجامعي,الكلية, التخصص, السعر, المدينة, اللغة",
        icon: <BiSearchAlt2 />,
      },
      {
        name: "سؤال",
        description:
          "يمكنك التواصل معنا من خلال مواقع التواصل الاجتماعي, البريد الالكتروني, الهاتف و الطرح الأسئلة . مستقبلا سيمكنك التواصل من خلال الموقع",
        icon: <BsQuestionLg />,
      },
      {
        name: "تقديم",
        description:
          "سنقوم بتقديم الأوراق الضرورية للجامعة المرغوبة من الطالب و تسجيل الطالب",
        icon: <IoDocumentOutline />,
      },
      {
        name: "ترجمة",
        description:
          "سنقوم بترجمة الأوراق الضرورية الى اللغة الروسية مثل الجواز و شهادة المدرسة",
        icon: <BsTranslate />,
      },
      {
        name: "استقبال",
        description:
          "سنستقبل الطالب في المطار و نأخذه الى السكن الجامعي و نكمل معه المعاملات الجامعية المتبقية",
        icon: <BsPeople />,
      },
      {
        name: "أخرى",
        description:
          "سنقوم بمساعدة الطلاب لعمل كل ما يحتاجه من معاملات و مستلزمات غير جامعية مثل الفحوصات, شريحة الهاتف و الحساب البنكي",
        icon: <AiFillThunderbolt />,
      },
    ],
  },
  about_us: {
    header: "عنا",
    question: "من نحن و من المؤسس ؟",
    text: "لاحظنا أن الطلاب الأجانب يواجهون صعوبات في التقدم للجامعات الروسية ، علاوة على ذلك ، تم الإبلاغ عن العديد من السرقات في العامين الماضيين ، وهذا هو السبب الرئيسي الذي جعلنا نفكر في إنشاء اكسبلور روسيا .اكسبلور روسيا ساعد الطلاب في اختيار كلية أحلامهم والتقدم إليها دون التعرض للسرقة ",
  },
  universities: {
    header: "الجامعات",
    question: "من نحن و من المؤسس ؟",
    form: {
      degree: "المستوى",
      spacialization: "التخصص",
      price: "السعر",
      city: "المدينة",
      langauge: "اللغة",
    },
    university: {
      name: "الاسم",
      deadline: "أخر يوم للتقديم",
      course: "التخصص",
      price: "السعر",
      code: "الكود",
      language: "اللغة",
      degree: "المستوى",
      city: "المدينة",
    },
  },
  FAQS: {
    header: "أسئلة شائعة",
    question: "هل لديك بعض من الأسئلة ؟ ",
    items: [
      {
        question: "كيف تتم عملية التسجيل ؟",
        answer:
          "بعد اختيار الطالب للجامعة المرغوبة وارسال الاوراق اللازمة نقوم بالتقديم في الجامعة. بعد موافقة الجامعة قد تطلب الجامعة نصف مبلغ السنة الدراسية لارسال الدعوة الدراسية و التي تعتبر ضرورية للحصول على الفيزا",
      },
      {
        question: "ما هي الدعوة الدراسية و متى توصل ؟",
        answer:
          "الدعوة الدراسية هي بمثابة طلب من الجامعة للسفارة الروسية اعطاء الطالب فيزا دراسية التي تمكنه من دخول روسيا بدونها لا يستطيع الطالب الحصول على فيزا و بذلك لا يستطيع دخول روسيا . و عادة تكون الدعوة جاهزة خلال شهر من القبول الجامعي ",
      },
      {
        question: "ماهي أفضل الجامعات للدراسة ؟",
        answer:
          "يعتمد على التخصص فهناك جامعات متخصصة لدراسة الطب و هناك اخرى متخصصة لدراسة الهندسة لكن بشكل عام أفضل الجامعات توجد في المدن الكبيرة مثل سانت بيتر برغ و موسكو",
      },
      {
        question: "كم يحتاج الطالب من المال للعيش في روسيا ؟",
        answer:
          "يعتمد على المدينة و طريقة عيش الطالب و لكن بشكل عام 250 - 350 دولار شهريا كافية للعيش",
      },
      {
        question: "ما هي أفضل المدن للدراسة و العيش ؟",
        answer: "تعتبر كل من سانت بطرسبرغ , موسكو و كازان الأفضل بالترتيب",
      },
    ],
  },
  contacts: {
    header: "تواصل ",
    question: "كيف تتواصل معنا ؟",
    items: [
      {
        id: 1,
        name: "بريد الكتروني",
        content: "exp.russia@gmail.com",
      },
      {
        id: 1,
        name: "الهاتف المحول",
        content: "776441777",
      },
      {
        id: 1,
        name: "الموقع",
        content: "exp.russia@gmail.com",
      },
    ],
  },
  footer: {
    links: {
      name: ": روابط",
      items: {
        home: "رئيسية",
        universities: "الجامعات",
        services: "الخدمات",
      },
    },
    contact: {
      name: ": تواصل",
    },
    about: {
      socail_media: ": مواقع التواصل الاجتماعي",
      text: "سنساعدكم بكل ما تحتاجونه للدراسة في روسيا",
    },
  },
};

export default ar;
