import React, { useState } from "react";
import FAQ from "../FAQItem/FAQ";
import './FAQList.css'
//ما هي الدعوة و متى توصل
// ما هي أفضل المدن للدراسة و العيش
// أفضل الجامعات للدراسة
// كم يحتاج الطالب للعيش
// كيف تتم عملية التسجيل

const faqs = [
  {
    question: "كيف تتم عملية التسجيل ",
    answer:
      "بعد اختيار الطالب للجامعة المرغوبة وارسال الاوراق اللازمة نقوم بالتقديم في الجامعة. بعد موافقة الجامعة قد تطلب الجامعة نصف مبلغ السنة الدراسية لارسال الدعوة الدراسية و التي تعتبر ضرورية للحصول على الفيزا",
  },
  {
    question: "ما هي الدعوة الدراسية و متى توصل",
    answer:
      "الدعوة الدراسية هي بمثابة طلب من الجامعة للسفارة الروسية اعطاء الطالب فيزا دراسية التي تمكنه من دخول روسيا بدونها لا يستطيع الطالب الحصول على فيزا و بذلك لا يستطيع دخول روسيا . و عادة تكون الدعوة جاهزة خلال شهر من القبول الجامعي ",
  },
  {
    question: "ماهي أفضل الجامعات للدراسة",
    answer:
      "يعتمد على التخصص فهناك جامعات متخصصة لدراسة الطب و هناك اخرى متخصصة لدراسة الهندسة لكن بشكل عام أفضل الجامعات توجد في المدن الكبيرة مثل سانت بيتر برغ و موسكو",
  },
  {
    question: "كم يحتاج الطالب من المال للعيش في روسيا",
    answer:
      "يعتمد على المدينة و طريقة عيش الطالب و لكن بشكل عام 250 - 350 دولار شهريا كافية للعيش",
  },
  {
    question: "ما هي أفضل المدن للدراسة و العيش",
    answer: "تعتبر كل من سانت بطرسبرغ , موسكو و كازان الأفضل بالترتيب",
  },
];
const FAQList = ({faqs}) => {

  return (
    <div className="faq-list">
      {faqs.map((faq) => {
        return <FAQ question={faq.question} answer={faq.answer} />;
      })}
    </div>
  );
};

export default FAQList;
